InformationRegisters/ОбщиеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеСведения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбщиеСвойстваГосуслуги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ОбщиеСвойстваГосуслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбщиеСведения/Ext/ManagerModule.bsl
Функция ПолучитьЗначение(Свойство, Контрагент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеСведенияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ОбщиеСведения.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Свойство = &Свойство) КАК ОбщиеСведенияСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат "";
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Значение;

КонецФункции // ()

Функция КонтрагентыСНовымиДанными(ПоследняяДатаОбнавления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ОбщиеСведенияСрезПоследних.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОбщиеСведения.СрезПервых(&ПоследняяДатаОбнавления, Контрагент.ПометкаУдаления = ЛОЖЬ) КАК ОбщиеСведенияСрезПоследних";
	
	Запрос.УстановитьПараметр(
		"ПоследняяДатаОбнавления",
		Новый Граница(ПоследняяДатаОбнавления, ВидГраницы.Исключая)
	);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции // ()
